Podkova/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
      <description>Возврат денежных средств от другой организации</description>
    </items>
    <items>
      <name>ВозвратДенежныхСредствОтПоставщика</name>
      <description>Возврат денежных средств от поставщика</description>
    </items>
    <items>
      <name>ВозвратОплатыКлиенту</name>
      <description>Возврат оплаты клиенту</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВДругуюКассу</name>
      <description>Выдача денежных средств в другую кассу</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВКассуККМ</name>
      <description>Выдача денежных средств в кассу ККМ</description>
    </items>
    <items>
      <name>ВыплатаЗаработнойПлаты</name>
      <description>Выплата заработной платы</description>
    </items>
    <items>
      <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
      <description>Оплата денежных средств в другую организацию</description>
    </items>
    <items>
      <name>ОплатаПоставщику</name>
      <description>Оплата поставщику</description>
    </items>
    <items>
      <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
      <description>Перечисление денежных средств на другой счет</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанкаВИностраннойВалюте</name>
      <description>Поступление денежных средств из банка (в иностранной валюте)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанка</name>
      <description>Поступление денежных средств из банка (в рублях)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
      <description>Поступление денежных средств из кассы ККМ</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствОтДругойОрганизации</name>
      <description>Поступление денежных средств от другой организации</description>
    </items>
    <items>
      <name>ПоступлениеОплатыОтКлиента</name>
      <description>Поступление оплаты от клиента</description>
    </items>
    <items>
      <name>КурсовыеРазницыПрибыль</name>
      <description>Прибыль от курсовых разниц</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанкВИностраннойВалюте</name>
      <description>Сдача денежных средств в банк (в иностранной валюте)</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанк</name>
      <description>Сдача денежных средств в банк (в рублях)</description>
    </items>
    <items>
      <name>КурсовыеРазницыУбыток</name>
      <description>Убыток от курсовых разниц</description>
    </items>
    <items>
      <name>ОперационнаяДеятельность</name>
      <description>Операционная деятельность</description>
    </items>
    <items>
      <name>ИнвестиционнаяДеятельность</name>
      <description>Инвестиционная деятельность</description>
    </items>
    <items>
      <name>ФинансоваяДеятельность</name>
      <description>Финансовая деятельность</description>
    </items>
  </predefined>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвиженияДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОплаты</name>
    <type>
      <types>CatalogRef.ПриоритетыОплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Podkova/src/Catalogs/СтатьиДвиженияДенежныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЭтоГруппа Тогда
	
		Если Не ПустаяСтрока(КорреспондирующийСчет) Тогда
			Если ПустаяСтрока(СтрЗаменить(КорреспондирующийСчет, ".", "")) Тогда
				КорреспондирующийСчет = "";
			ИначеЕсли Прав(СокрЛП(КорреспондирующийСчет), 1) = "." Тогда
				КорреспондирующийСчет = Лев(СокрЛП(КорреспондирующийСчет), СтрДлина(СокрЛП(КорреспондирующийСчет)) - 1);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") Тогда
			
			Если ХозяйственныеОперации.Найти(ДанныеЗаполнения.ХозяйственнаяОперация) = Неопределено Тогда
				
				ХозяйственныеОперации.Добавить().ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
